package service;

import java.awt.Component;

import classes.Visitor;

/* Інтерфейс, з допомогою якого відвідувач буде спілкуватися 
 * з усіма об'єктами незалежно від того, якого вони типу */
public interface IFromTo {

	/* Метод обробки події "Початку руху відвідувача"
	 * Викликається перед початком руху відвідувача
	 * У якості параметрів отримує відвідувача */
	public void onOut(Visitor vis);
	
	/* Метод обробки події "Кінець руху відвідувача"
	 * Викликається коли відвідувача дійшов до об'єкта
	 * У якості параметрів отримує відвідувача */
	public void onIn(Visitor vis);
	
	/* Метод, який надає доступ до компоненту, який 
	 * представляє об'єкт на Gui
	 * Повертає об'єкт типу Component */
	public Component getComponent();
	
}
